# 문제 : 머쓱이는 친구에게 모스부호를 이용한 편지를 받았습니다. 그냥은 읽을 수 없어 이를 해독하는 프로그램을 만들려고 합니다. 문자열 letter가 매개변수로 주어질 때, letter를 영어 소문자로 바꾼 문자열을 return 하도록 solution 함수를 완성해보세요.
# 모스부호는 다음과 같습니다.
# 출처 : https://school.programmers.co.kr/learn/courses/30/lessons/120838

def solution(letter):
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
}
    return ''.join(morse[code] for code in letter.split())

# 가장 정석이고 제일 보기 좋은 것 같다.
# 처음에 split()안 쓰고 그냥 구하려고 했는데 공백으로 구분되어 있기 때문에 split()써야 하고, 딕셔너리 키 값이 모스 부호이기 때문에 키 값에 대응한 값을 출력하면 된다.
